{
    "items": [
        {
            "id": 1,
            "title": "Software Engineer",
            "company": "CodeIT",
            "period": "2024 - Present",
            "description": "At CodeIT I'm building industrial applications focused on automated product labeling and traceability within food, wood and traditional industry.<br><br>It's a mix of hardware and software, and a big part of the job is making those two worlds connect.",
            "highlights": [
                "Completed several customer projects for different types of production facilities. It includes things as database architecture, ERP integrations, PIM system, EDI file handling, PLC and IO handling, automated and manual labeling applications, OEE system and more."
            ],
            "technologies": [
                "Microsoft SQL Server",
                "Python",
                "CodeIT Enterprise Platform",
                "MQTT"
            ]
        },
        {
            "id": 2,
            "title": "Programmer",
            "company": "Self-employed",
            "period": "2022-2024",
            "description": "This is were my developer career truly got started. A good friend of mine had successfully been running a horse racing prediction model for several years. He wanted to outsource some parts of that work and asked me to do it, which I accepted. It turned out to be an amazing learning experience.",
            "highlights": [
                "A dashboard using Node.JS that tracked progress in real time of the web-scrapers that we had running several times per day. It also provided metrics for the quality of the collected data, as well as functionality to run various scripts/tasks on the server.<br><br>",
                "A CLI app in Python which was the predecessor to the Node.JS dashboard. It had roughly the same functionality but it was run directly on the terminal instead. It could also generate email reports.<br><br>",
                "Web scraping using Puppeteer, as well as Python scripts for talking to APIs such as the betfair api."
            ],
            "technologies": ["Python", "Node.js", "React", "SQlite", "Ubuntu"]
        },
        {
            "id": 3,
            "title": "Contributor",
            "company": "Open source community",
            "period": "2023 - Present",
            "description": "Open source software really is an amazing thing. But I also felt like it was quite intimidating to get into as junior developer. I decided to force myself out of my comfort zone and make some contributions to a project. Which I am very happy that I did, and I hope to make many more contributions in the future.",
            "highlights": [
                "Go Blueprint - A Golang project scaffolding tool with over 6.9k starts on Github. I helped fix a choice selection bug, a broken version command, and issues with the issue templates on Github. This experience really helped me improve my git skills since I had to get into creating issues on github, creating my own feature branches and merging in new changes, as well as coordinating with different people."
            ],
            "technologies": ["Github", "Git", "Golang"]
        },
        {
            "id": 4,
            "title": "Student",
            "company": "Boot.dev",
            "period": "2023",
            "description": "I completed the back-end career path on boot.dev, which is an online platform with a comprehensive, extremely well made program for learning backend programming. It included 20 courses as well as guided projects and solo projects. If someone asked me where they can learn backend development, boot.dev is the place I would recommend.",
            "highlights": [
                "2-player snake game made in python. A re-creation of an old flash game I played as a kid",
                "Maze-solving DFS-algo using Python and Tkinter",
                "Top XYZ - A web app where you can create toplists for any topic you desire"
            ],
            "technologies": [
                "Python",
                "Javascript",
                "Golang",
                "SQL",
                "Data structures",
                "Algorithms"
            ]
        },
        {
            "id": 5,
            "title": "Customer service agent",
            "company": "Diakrit",
            "period": "2018-2021",
            "description": "Diakrit is a company that provide digital marketing materal for real estate agents, including some pretty cool stuff like virtual tours and drone videos. For this job I was coordinating between photgraphers, real estate agents, sellers and our internal production/editing teams. Working with customer service was a great experience for getting better at communicating with people. Both through speech and through writing.",
            "highlights": [
                "Took initiate within the team to troubleshoot technical problems related to invoicing.",
                "Created internal documentation with instructions on performing common tasks",
                "Hundreds of positive customer interactions every month (and a few less positive ones)"
            ],
            "technologies": ["A good 'ol headset"]
        }
    ]
}
